; ModuleID = './balancer_kern.bc'
source_filename = "bpf/balancer_kern.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.____btf_map_ctl_array = type { i32, %struct.ctl_value }
%struct.ctl_value = type { %union.anon }
%union.anon = type { i64 }
%struct.____btf_map_vip_map = type { %struct.vip_definition, %struct.vip_meta }
%struct.vip_definition = type { %union.anon.0, i16, i8 }
%union.anon.0 = type { [4 x i32] }
%struct.vip_meta = type { i32, i32 }
%struct.____btf_map_fallback_cache = type { %struct.flow_key, %struct.real_pos_lru }
%struct.flow_key = type { %union.anon.1, %union.anon.2, %union.anon.3, i8 }
%union.anon.1 = type { [4 x i32] }
%union.anon.2 = type { [4 x i32] }
%union.anon.3 = type { i32 }
%struct.real_pos_lru = type { i32, i64 }
%struct.____btf_map_ch_rings = type { i32, i32 }
%struct.____btf_map_reals = type { i32, %struct.real_definition }
%struct.real_definition = type { %union.anon.4, i8 }
%union.anon.4 = type { [4 x i32] }
%struct.____btf_map_reals_stats = type { i32, %struct.lb_stats }
%struct.lb_stats = type { i64, i64 }
%struct.____btf_map_stats = type { i32, %struct.lb_stats }
%struct.____btf_map_server_id_map = type { i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.packet_description = type { %struct.flow_key, i32, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ctl_array", scope: !2, file: !78, line: 35, type: !100, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !75, nameTableKind: None)
!3 = !DIFile(filename: "bpf/balancer_kern.c", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3226, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/bpf.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262, isUnsigned: true)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263, isUnsigned: true)
!45 = !{!46, !47, !48, !51, !52, !66, !71, !72, !74}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_long_header", file: !54, line: 40, size: 112, elements: !55)
!54 = !DIFile(filename: "bpf/pckt_parsing.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!55 = !{!56, !59, !61, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !53, file: !54, line: 41, baseType: !57, size: 8)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !58)
!58 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !53, file: !54, line: 42, baseType: !60, size: 32, offset: 8)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_lens", scope: !53, file: !54, line: 45, baseType: !57, size: 8, offset: 40)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dst_connection_id", scope: !53, file: !54, line: 49, baseType: !63, size: 64, offset: 48)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 8, lowerBound: 0)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_short_header", file: !54, line: 52, size: 72, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !54, line: 53, baseType: !57, size: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "connection_id", scope: !67, file: !54, line: 54, baseType: !63, size: 64, offset: 8)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !73, line: 35, baseType: !7)
!73 = !DIFile(filename: "./include/jhash.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !{!0, !76, !97, !110, !134, !136, !138, !169, !171, !177, !179, !193, !195, !205, !207, !213, !215, !221, !225, !230, !235, !237, !242}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "____btf_map_ctl_array", scope: !2, file: !78, line: 42, type: !79, isLocal: false, isDefinition: true)
!78 = !DIFile(filename: "bpf/control_data_maps.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_ctl_array", file: !78, line: 42, size: 128, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !79, file: !78, line: 42, baseType: !60, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !78, line: 42, baseType: !83, size: 64, offset: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_value", file: !84, line: 53, size: 64, elements: !85)
!84 = !DIFile(filename: "bpf/balancer_structs.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !83, file: !84, line: 54, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !84, line: 54, size: 64, elements: !88)
!88 = !{!89, !92, !93}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !87, file: !84, line: 55, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !49, line: 31, baseType: !91)
!91 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !87, file: !84, line: 56, baseType: !60, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !87, file: !84, line: 57, baseType: !94, size: 48)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 48, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 6, lowerBound: 0)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "vip_map", scope: !2, file: !99, line: 32, type: !100, isLocal: false, isDefinition: true)
!99 = !DIFile(filename: "bpf/balancer_maps.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !101, line: 245, size: 224, elements: !102)
!101 = !DIFile(filename: "./include/bpf_helpers.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!102 = !{!103, !104, !105, !106, !107, !108, !109}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !101, line: 246, baseType: !7, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !100, file: !101, line: 247, baseType: !7, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !100, file: !101, line: 248, baseType: !7, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !100, file: !101, line: 249, baseType: !7, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !100, file: !101, line: 250, baseType: !7, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !100, file: !101, line: 251, baseType: !7, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !100, file: !101, line: 252, baseType: !7, size: 32, offset: 192)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "____btf_map_vip_map", scope: !2, file: !99, line: 39, type: !112, isLocal: false, isDefinition: true)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_vip_map", file: !99, line: 39, size: 224, elements: !113)
!113 = !{!114, !129}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !112, file: !99, line: 39, baseType: !115, size: 160)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_definition", file: !84, line: 62, size: 160, elements: !116)
!116 = !{!117, !127, !128}
!117 = !DIDerivedType(tag: DW_TAG_member, scope: !115, file: !84, line: 63, baseType: !118, size: 128)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !115, file: !84, line: 63, size: 128, elements: !119)
!119 = !{!120, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !118, file: !84, line: 64, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !122, line: 30, baseType: !60)
!122 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vipv6", scope: !118, file: !84, line: 65, baseType: !124, size: 128)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 4, lowerBound: 0)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !115, file: !84, line: 67, baseType: !48, size: 16, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !115, file: !84, line: 68, baseType: !57, size: 8, offset: 144)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !112, file: !99, line: 39, baseType: !130, size: 64, offset: 160)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_meta", file: !84, line: 72, size: 64, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !130, file: !84, line: 73, baseType: !60, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "vip_num", scope: !130, file: !84, line: 74, baseType: !60, size: 32, offset: 32)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "lru_mapping", scope: !2, file: !99, line: 43, type: !100, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "fallback_cache", scope: !2, file: !99, line: 52, type: !100, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "____btf_map_fallback_cache", scope: !2, file: !99, line: 59, type: !140, isLocal: false, isDefinition: true)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_fallback_cache", file: !99, line: 59, size: 448, elements: !141)
!141 = !{!142, !164}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !140, file: !99, line: 59, baseType: !143, size: 320)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_key", file: !84, line: 26, size: 320, elements: !144)
!144 = !{!145, !150, !155, !163}
!145 = !DIDerivedType(tag: DW_TAG_member, scope: !143, file: !84, line: 27, baseType: !146, size: 128)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !143, file: !84, line: 27, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !146, file: !84, line: 28, baseType: !121, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !146, file: !84, line: 29, baseType: !124, size: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !143, file: !84, line: 31, baseType: !151, size: 128, offset: 128)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !143, file: !84, line: 31, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !151, file: !84, line: 32, baseType: !121, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !151, file: !84, line: 33, baseType: !124, size: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !143, file: !84, line: 35, baseType: !156, size: 32, offset: 256)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !143, file: !84, line: 35, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !156, file: !84, line: 36, baseType: !60, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !156, file: !84, line: 37, baseType: !160, size: 32)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 2, lowerBound: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !143, file: !84, line: 39, baseType: !57, size: 8, offset: 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !140, file: !99, line: 59, baseType: !165, size: 128, offset: 320)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_pos_lru", file: !84, line: 78, size: 128, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !165, file: !84, line: 79, baseType: !60, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !165, file: !84, line: 80, baseType: !90, size: 64, offset: 64)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "ch_rings", scope: !2, file: !99, line: 62, type: !100, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "____btf_map_ch_rings", scope: !2, file: !99, line: 69, type: !173, isLocal: false, isDefinition: true)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_ch_rings", file: !99, line: 69, size: 64, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !173, file: !99, line: 69, baseType: !60, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !173, file: !99, line: 69, baseType: !60, size: 32, offset: 32)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "reals", scope: !2, file: !99, line: 72, type: !100, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "____btf_map_reals", scope: !2, file: !99, line: 79, type: !181, isLocal: false, isDefinition: true)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_reals", file: !99, line: 79, size: 192, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !181, file: !99, line: 79, baseType: !60, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !181, file: !99, line: 79, baseType: !185, size: 160, offset: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_definition", file: !84, line: 84, size: 160, elements: !186)
!186 = !{!187, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !84, line: 85, baseType: !188, size: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !185, file: !84, line: 85, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !188, file: !84, line: 86, baseType: !121, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !188, file: !84, line: 87, baseType: !124, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !84, line: 89, baseType: !57, size: 8, offset: 128)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "reals_stats", scope: !2, file: !99, line: 82, type: !100, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "____btf_map_reals_stats", scope: !2, file: !99, line: 89, type: !197, isLocal: false, isDefinition: true)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_reals_stats", file: !99, line: 89, size: 192, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !197, file: !99, line: 89, baseType: !60, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !99, line: 89, baseType: !201, size: 128, offset: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_stats", file: !84, line: 93, size: 128, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !201, file: !84, line: 94, baseType: !90, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !201, file: !84, line: 95, baseType: !90, size: 64, offset: 64)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "stats", scope: !2, file: !99, line: 92, type: !100, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "____btf_map_stats", scope: !2, file: !99, line: 99, type: !209, isLocal: false, isDefinition: true)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_stats", file: !99, line: 99, size: 192, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !209, file: !99, line: 99, baseType: !60, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !209, file: !99, line: 99, baseType: !201, size: 128, offset: 64)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "server_id_map", scope: !2, file: !99, line: 103, type: !100, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "____btf_map_server_id_map", scope: !2, file: !99, line: 110, type: !217, isLocal: false, isDefinition: true)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "____btf_map_server_id_map", file: !99, line: 110, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !217, file: !99, line: 110, baseType: !60, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !217, file: !99, line: 110, baseType: !60, size: 32, offset: 32)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 693, type: !223, isLocal: false, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 32, elements: !125)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !101, line: 22, type: !227, isLocal: true, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!46, !46, !46}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !101, line: 44, type: !232, isLocal: true, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!91}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !101, line: 38, type: !232, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !101, line: 24, type: !239, isLocal: true, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!74, !46, !46, !46, !91}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !101, line: 81, type: !244, isLocal: true, isDefinition: true)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!74, !46, !74}
!247 = !{i32 2, !"Dwarf Version", i32 4}
!248 = !{i32 2, !"Debug Info Version", i32 3}
!249 = !{i32 1, !"wchar_size", i32 4}
!250 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!251 = distinct !DISubprogram(name: "balancer_ingress", scope: !3, file: !3, line: 668, type: !252, scopeLine: 668, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !262)
!252 = !DISubroutineType(types: !253)
!253 = !{!74, !254}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3237, size: 160, elements: !256)
!256 = !{!257, !258, !259, !260, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !255, file: !6, line: 3238, baseType: !60, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !255, file: !6, line: 3239, baseType: !60, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !255, file: !6, line: 3240, baseType: !60, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !255, file: !6, line: 3242, baseType: !60, size: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !255, file: !6, line: 3243, baseType: !60, size: 32, offset: 128)
!262 = !{!263, !264, !265, !266, !274, !275}
!263 = !DILocalVariable(name: "ctx", arg: 1, scope: !251, file: !3, line: 668, type: !254)
!264 = !DILocalVariable(name: "data", scope: !251, file: !3, line: 669, type: !46)
!265 = !DILocalVariable(name: "data_end", scope: !251, file: !3, line: 670, type: !46)
!266 = !DILocalVariable(name: "eth", scope: !251, file: !3, line: 671, type: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eth_hdr", file: !54, line: 57, size: 112, elements: !269)
!269 = !{!270, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "eth_dest", scope: !268, file: !54, line: 58, baseType: !271, size: 48)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 48, elements: !95)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "eth_source", scope: !268, file: !54, line: 59, baseType: !271, size: 48, offset: 48)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "eth_proto", scope: !268, file: !54, line: 60, baseType: !50, size: 16, offset: 96)
!274 = !DILocalVariable(name: "eth_proto", scope: !251, file: !3, line: 672, type: !60)
!275 = !DILocalVariable(name: "nh_off", scope: !251, file: !3, line: 673, type: !60)
!276 = !DILocalVariable(name: "tmp_addr", scope: !277, file: !278, line: 93, type: !124)
!277 = distinct !DISubprogram(name: "send_icmp6_reply", scope: !278, file: !278, line: 90, type: !279, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !281)
!278 = !DIFile(filename: "bpf/handle_icmp.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!279 = !DISubroutineType(types: !280)
!280 = !{!74, !46, !46}
!281 = !{!282, !283, !284, !314, !276, !357}
!282 = !DILocalVariable(name: "data", arg: 1, scope: !277, file: !278, line: 90, type: !46)
!283 = !DILocalVariable(name: "data_end", arg: 2, scope: !277, file: !278, line: 90, type: !46)
!284 = !DILocalVariable(name: "ip6h", scope: !277, file: !278, line: 91, type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !287, line: 117, size: 320, elements: !288)
!287 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!288 = !{!289, !290, !291, !295, !297, !298, !299, !313}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !286, file: !287, line: 119, baseType: !57, size: 4, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !286, file: !287, line: 120, baseType: !57, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !286, file: !287, line: 127, baseType: !292, size: 24, offset: 8)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 24, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 3, lowerBound: 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !286, file: !287, line: 129, baseType: !296, size: 16, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !122, line: 28, baseType: !48)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !286, file: !287, line: 130, baseType: !57, size: 8, offset: 48)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !286, file: !287, line: 131, baseType: !57, size: 8, offset: 56)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !286, file: !287, line: 133, baseType: !300, size: 128, offset: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !301, line: 33, size: 128, elements: !302)
!301 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !300, file: !301, line: 40, baseType: !304, size: 128)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !301, line: 34, size: 128, elements: !305)
!305 = !{!306, !310, !312}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !304, file: !301, line: 35, baseType: !307, size: 128)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 16, lowerBound: 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !304, file: !301, line: 37, baseType: !311, size: 128)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 128, elements: !64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !304, file: !301, line: 38, baseType: !124, size: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !286, file: !287, line: 134, baseType: !300, size: 128, offset: 192)
!314 = !DILocalVariable(name: "icmp_hdr", scope: !277, file: !278, line: 92, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !317, line: 8, size: 64, elements: !318)
!317 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "")
!318 = !{!319, !320, !321, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !316, file: !317, line: 10, baseType: !57, size: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !316, file: !317, line: 11, baseType: !57, size: 8, offset: 8)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !316, file: !317, line: 12, baseType: !322, size: 16, offset: 16)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !122, line: 34, baseType: !48)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !316, file: !317, line: 63, baseType: !324, size: 32, offset: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !317, line: 15, size: 32, elements: !325)
!325 = !{!326, !330, !332, !334, !339, !347}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !324, file: !317, line: 16, baseType: !327, size: 32)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 1, lowerBound: 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !324, file: !317, line: 17, baseType: !331, size: 32)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 32, elements: !161)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !324, file: !317, line: 18, baseType: !333, size: 32)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32, elements: !125)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !324, file: !317, line: 23, baseType: !335, size: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !317, line: 20, size: 32, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !335, file: !317, line: 21, baseType: !296, size: 16)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !335, file: !317, line: 22, baseType: !296, size: 16, offset: 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !324, file: !317, line: 40, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !317, line: 25, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !340, file: !317, line: 27, baseType: !60, size: 5, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !340, file: !317, line: 28, baseType: !60, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !340, file: !317, line: 29, baseType: !60, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !340, file: !317, line: 30, baseType: !60, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !340, file: !317, line: 31, baseType: !60, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !324, file: !317, line: 61, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !317, line: 42, size: 32, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !348, file: !317, line: 43, baseType: !57, size: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !348, file: !317, line: 45, baseType: !57, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !348, file: !317, line: 46, baseType: !57, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !348, file: !317, line: 47, baseType: !57, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !348, file: !317, line: 48, baseType: !57, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !348, file: !317, line: 49, baseType: !57, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !348, file: !317, line: 60, baseType: !296, size: 16, offset: 16)
!357 = !DILocalVariable(name: "off", scope: !277, file: !278, line: 94, type: !90)
!358 = !DILocation(line: 93, column: 10, scope: !277, inlinedAt: !359)
!359 = distinct !DILocation(line: 232, column: 12, scope: !360, inlinedAt: !379)
!360 = distinct !DILexicalBlock(scope: !361, file: !278, line: 231, column: 52)
!361 = distinct !DILexicalBlock(scope: !362, file: !278, line: 231, column: 7)
!362 = distinct !DISubprogram(name: "parse_icmpv6", scope: !278, file: !278, line: 223, type: !363, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !372)
!363 = !DISubroutineType(types: !364)
!364 = !{!74, !46, !46, !90, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_description", file: !84, line: 43, size: 384, elements: !367)
!367 = !{!368, !369, !370, !371}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !366, file: !84, line: 44, baseType: !143, size: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "real_index", scope: !366, file: !84, line: 45, baseType: !60, size: 32, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !84, line: 46, baseType: !57, size: 8, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !366, file: !84, line: 48, baseType: !57, size: 8, offset: 360)
!372 = !{!373, !374, !375, !376, !377, !378}
!373 = !DILocalVariable(name: "data", arg: 1, scope: !362, file: !278, line: 223, type: !46)
!374 = !DILocalVariable(name: "data_end", arg: 2, scope: !362, file: !278, line: 223, type: !46)
!375 = !DILocalVariable(name: "off", arg: 3, scope: !362, file: !278, line: 223, type: !90)
!376 = !DILocalVariable(name: "pckt", arg: 4, scope: !362, file: !278, line: 224, type: !365)
!377 = !DILocalVariable(name: "icmp_hdr", scope: !362, file: !278, line: 225, type: !315)
!378 = !DILocalVariable(name: "ip6h", scope: !362, file: !278, line: 226, type: !285)
!379 = distinct !DILocation(line: 197, column: 16, scope: !380, inlinedAt: !417)
!380 = distinct !DILexicalBlock(scope: !381, file: !3, line: 196, column: 45)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 196, column: 16)
!382 = distinct !DILexicalBlock(scope: !383, file: !3, line: 193, column: 9)
!383 = distinct !DILexicalBlock(scope: !384, file: !3, line: 177, column: 16)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 177, column: 7)
!385 = distinct !DISubprogram(name: "process_l3_headers", scope: !3, file: !3, line: 169, type: !386, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !390)
!386 = !DISubroutineType(types: !387)
!387 = !{!74, !365, !388, !90, !51, !46, !46, !389}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!389 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !416}
!391 = !DILocalVariable(name: "pckt", arg: 1, scope: !385, file: !3, line: 169, type: !365)
!392 = !DILocalVariable(name: "protocol", arg: 2, scope: !385, file: !3, line: 170, type: !388)
!393 = !DILocalVariable(name: "off", arg: 3, scope: !385, file: !3, line: 170, type: !90)
!394 = !DILocalVariable(name: "pkt_bytes", arg: 4, scope: !385, file: !3, line: 171, type: !51)
!395 = !DILocalVariable(name: "data", arg: 5, scope: !385, file: !3, line: 171, type: !46)
!396 = !DILocalVariable(name: "data_end", arg: 6, scope: !385, file: !3, line: 172, type: !46)
!397 = !DILocalVariable(name: "is_ipv6", arg: 7, scope: !385, file: !3, line: 172, type: !389)
!398 = !DILocalVariable(name: "iph_len", scope: !385, file: !3, line: 173, type: !90)
!399 = !DILocalVariable(name: "action", scope: !385, file: !3, line: 174, type: !74)
!400 = !DILocalVariable(name: "iph", scope: !385, file: !3, line: 175, type: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !403, line: 86, size: 160, elements: !404)
!403 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !402, file: !403, line: 88, baseType: !57, size: 4, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !402, file: !403, line: 89, baseType: !57, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !402, file: !403, line: 96, baseType: !57, size: 8, offset: 8)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !402, file: !403, line: 97, baseType: !296, size: 16, offset: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !403, line: 98, baseType: !296, size: 16, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !402, file: !403, line: 99, baseType: !296, size: 16, offset: 48)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !402, file: !403, line: 100, baseType: !57, size: 8, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !402, file: !403, line: 101, baseType: !57, size: 8, offset: 72)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !402, file: !403, line: 102, baseType: !322, size: 16, offset: 80)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !402, file: !403, line: 103, baseType: !121, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !402, file: !403, line: 104, baseType: !121, size: 32, offset: 128)
!416 = !DILocalVariable(name: "ip6h", scope: !385, file: !3, line: 176, type: !285)
!417 = distinct !DILocation(line: 420, column: 12, scope: !418, inlinedAt: !468)
!418 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 404, type: !419, scopeLine: 405, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!74, !46, !90, !46, !389, !254}
!421 = !{!422, !423, !424, !425, !426, !427, !429, !431, !432, !433, !435, !437, !438, !439, !440, !441, !442, !443, !444, !447, !448, !449, !452, !454, !457, !458, !461, !462, !467}
!422 = !DILocalVariable(name: "data", arg: 1, scope: !418, file: !3, line: 404, type: !46)
!423 = !DILocalVariable(name: "off", arg: 2, scope: !418, file: !3, line: 404, type: !90)
!424 = !DILocalVariable(name: "data_end", arg: 3, scope: !418, file: !3, line: 404, type: !46)
!425 = !DILocalVariable(name: "is_ipv6", arg: 4, scope: !418, file: !3, line: 405, type: !389)
!426 = !DILocalVariable(name: "xdp", arg: 5, scope: !418, file: !3, line: 405, type: !254)
!427 = !DILocalVariable(name: "cval", scope: !418, file: !3, line: 407, type: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!429 = !DILocalVariable(name: "dst", scope: !418, file: !3, line: 408, type: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!431 = !DILocalVariable(name: "pckt", scope: !418, file: !3, line: 409, type: !366)
!432 = !DILocalVariable(name: "vip", scope: !418, file: !3, line: 410, type: !115)
!433 = !DILocalVariable(name: "vip_info", scope: !418, file: !3, line: 411, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!435 = !DILocalVariable(name: "data_stats", scope: !418, file: !3, line: 412, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!437 = !DILocalVariable(name: "iph_len", scope: !418, file: !3, line: 413, type: !90)
!438 = !DILocalVariable(name: "protocol", scope: !418, file: !3, line: 414, type: !57)
!439 = !DILocalVariable(name: "action", scope: !418, file: !3, line: 416, type: !74)
!440 = !DILocalVariable(name: "vip_num", scope: !418, file: !3, line: 417, type: !60)
!441 = !DILocalVariable(name: "mac_addr_pos", scope: !418, file: !3, line: 418, type: !60)
!442 = !DILocalVariable(name: "pkt_bytes", scope: !418, file: !3, line: 419, type: !48)
!443 = !DILocalVariable(name: "stats_key", scope: !418, file: !3, line: 504, type: !60)
!444 = !DILocalVariable(name: "quic_stats_key", scope: !445, file: !3, line: 515, type: !60)
!445 = distinct !DILexicalBlock(scope: !446, file: !3, line: 514, column: 39)
!446 = distinct !DILexicalBlock(scope: !418, file: !3, line: 514, column: 7)
!447 = !DILocalVariable(name: "quic_stats", scope: !445, file: !3, line: 516, type: !436)
!448 = !DILocalVariable(name: "real_index", scope: !445, file: !3, line: 520, type: !74)
!449 = !DILocalVariable(name: "key", scope: !450, file: !3, line: 524, type: !60)
!450 = distinct !DILexicalBlock(scope: !451, file: !3, line: 522, column: 25)
!451 = distinct !DILexicalBlock(scope: !445, file: !3, line: 522, column: 9)
!452 = !DILocalVariable(name: "real_pos", scope: !450, file: !3, line: 525, type: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!454 = !DILocalVariable(name: "cpu_num", scope: !455, file: !3, line: 556, type: !60)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 550, column: 13)
!456 = distinct !DILexicalBlock(scope: !418, file: !3, line: 550, column: 7)
!457 = !DILocalVariable(name: "lru_map", scope: !455, file: !3, line: 557, type: !46)
!458 = !DILocalVariable(name: "lru_stats_key", scope: !459, file: !3, line: 560, type: !60)
!459 = distinct !DILexicalBlock(scope: !460, file: !3, line: 558, column: 19)
!460 = distinct !DILexicalBlock(scope: !455, file: !3, line: 558, column: 9)
!461 = !DILocalVariable(name: "lru_stats", scope: !459, file: !3, line: 561, type: !436)
!462 = !DILocalVariable(name: "lru_stats_key", scope: !463, file: !3, line: 603, type: !60)
!463 = distinct !DILexicalBlock(scope: !464, file: !3, line: 602, column: 43)
!464 = distinct !DILexicalBlock(scope: !465, file: !3, line: 602, column: 11)
!465 = distinct !DILexicalBlock(scope: !466, file: !3, line: 601, column: 15)
!466 = distinct !DILexicalBlock(scope: !455, file: !3, line: 601, column: 9)
!467 = !DILocalVariable(name: "lru_stats", scope: !463, file: !3, line: 604, type: !436)
!468 = distinct !DILocation(line: 686, column: 12, scope: !469)
!469 = distinct !DILexicalBlock(scope: !470, file: !3, line: 685, column: 42)
!470 = distinct !DILexicalBlock(scope: !471, file: !3, line: 685, column: 14)
!471 = distinct !DILexicalBlock(scope: !251, file: !3, line: 683, column: 7)
!472 = !DILocalVariable(name: "tmp_mac", scope: !473, file: !278, line: 41, type: !271)
!473 = distinct !DISubprogram(name: "swap_mac_and_send", scope: !278, file: !278, line: 39, type: !279, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !474)
!474 = !{!475, !476, !477, !472}
!475 = !DILocalVariable(name: "data", arg: 1, scope: !473, file: !278, line: 39, type: !46)
!476 = !DILocalVariable(name: "data_end", arg: 2, scope: !473, file: !278, line: 39, type: !46)
!477 = !DILocalVariable(name: "eth", scope: !473, file: !278, line: 40, type: !267)
!478 = !DILocation(line: 41, column: 17, scope: !473, inlinedAt: !479)
!479 = distinct !DILocation(line: 86, column: 10, scope: !480, inlinedAt: !511)
!480 = distinct !DISubprogram(name: "send_icmp_reply", scope: !278, file: !278, line: 59, type: !279, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !481)
!481 = !{!482, !483, !484, !485, !508, !509, !510}
!482 = !DILocalVariable(name: "data", arg: 1, scope: !480, file: !278, line: 59, type: !46)
!483 = !DILocalVariable(name: "data_end", arg: 2, scope: !480, file: !278, line: 59, type: !46)
!484 = !DILocalVariable(name: "iph", scope: !480, file: !278, line: 60, type: !401)
!485 = !DILocalVariable(name: "icmp_hdr", scope: !480, file: !278, line: 61, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !488, line: 89, size: 64, elements: !489)
!488 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "")
!489 = !{!490, !491, !492, !493}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !488, line: 90, baseType: !57, size: 8)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !487, file: !488, line: 91, baseType: !57, size: 8, offset: 8)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !487, file: !488, line: 92, baseType: !322, size: 16, offset: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !487, file: !488, line: 104, baseType: !494, size: 32, offset: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !487, file: !488, line: 93, size: 32, elements: !495)
!495 = !{!496, !501, !502, !507}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !494, file: !488, line: 97, baseType: !497, size: 32)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !488, line: 94, size: 32, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !497, file: !488, line: 95, baseType: !296, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !497, file: !488, line: 96, baseType: !296, size: 16, offset: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !494, file: !488, line: 98, baseType: !121, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !494, file: !488, line: 102, baseType: !503, size: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !488, line: 99, size: 32, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !503, file: !488, line: 100, baseType: !296, size: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !503, file: !488, line: 101, baseType: !296, size: 16, offset: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !494, file: !488, line: 103, baseType: !333, size: 32)
!508 = !DILocalVariable(name: "tmp_addr", scope: !480, file: !278, line: 62, type: !60)
!509 = !DILocalVariable(name: "csum", scope: !480, file: !278, line: 63, type: !90)
!510 = !DILocalVariable(name: "off", scope: !480, file: !278, line: 64, type: !90)
!511 = distinct !DILocation(line: 262, column: 12, scope: !512, inlinedAt: !522)
!512 = distinct !DILexicalBlock(scope: !513, file: !278, line: 261, column: 36)
!513 = distinct !DILexicalBlock(scope: !514, file: !278, line: 261, column: 7)
!514 = distinct !DISubprogram(name: "parse_icmp", scope: !278, file: !278, line: 253, type: !363, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !515)
!515 = !{!516, !517, !518, !519, !520, !521}
!516 = !DILocalVariable(name: "data", arg: 1, scope: !514, file: !278, line: 253, type: !46)
!517 = !DILocalVariable(name: "data_end", arg: 2, scope: !514, file: !278, line: 253, type: !46)
!518 = !DILocalVariable(name: "off", arg: 3, scope: !514, file: !278, line: 253, type: !90)
!519 = !DILocalVariable(name: "pckt", arg: 4, scope: !514, file: !278, line: 254, type: !365)
!520 = !DILocalVariable(name: "icmp_hdr", scope: !514, file: !278, line: 255, type: !486)
!521 = !DILocalVariable(name: "iph", scope: !514, file: !278, line: 256, type: !401)
!522 = distinct !DILocation(line: 227, column: 16, scope: !523, inlinedAt: !417)
!523 = distinct !DILexicalBlock(scope: !524, file: !3, line: 226, column: 36)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 226, column: 9)
!525 = distinct !DILexicalBlock(scope: !384, file: !3, line: 205, column: 10)
!526 = !DILocation(line: 41, column: 17, scope: !473, inlinedAt: !527)
!527 = distinct !DILocation(line: 112, column: 10, scope: !277, inlinedAt: !359)
!528 = !DILocation(line: 41, column: 17, scope: !473, inlinedAt: !529)
!529 = distinct !DILocation(line: 86, column: 10, scope: !480, inlinedAt: !530)
!530 = distinct !DILocation(line: 262, column: 12, scope: !512, inlinedAt: !531)
!531 = distinct !DILocation(line: 227, column: 16, scope: !523, inlinedAt: !532)
!532 = distinct !DILocation(line: 420, column: 12, scope: !418, inlinedAt: !533)
!533 = distinct !DILocation(line: 684, column: 12, scope: !534)
!534 = distinct !DILexicalBlock(scope: !471, file: !3, line: 683, column: 33)
!535 = !DILocation(line: 41, column: 17, scope: !473, inlinedAt: !536)
!536 = distinct !DILocation(line: 112, column: 10, scope: !277, inlinedAt: !537)
!537 = distinct !DILocation(line: 232, column: 12, scope: !360, inlinedAt: !538)
!538 = distinct !DILocation(line: 197, column: 16, scope: !380, inlinedAt: !532)
!539 = !DILocation(line: 668, column: 37, scope: !251)
!540 = !DILocation(line: 669, column: 35, scope: !251)
!541 = !{!542, !543, i64 0}
!542 = !{!"xdp_md", !543, i64 0, !543, i64 4, !543, i64 8, !543, i64 12, !543, i64 16}
!543 = !{!"int", !544, i64 0}
!544 = !{!"omnipotent char", !545, i64 0}
!545 = !{!"Simple C/C++ TBAA"}
!546 = !DILocation(line: 669, column: 24, scope: !251)
!547 = !DILocation(line: 669, column: 16, scope: !251)
!548 = !DILocation(line: 669, column: 9, scope: !251)
!549 = !DILocation(line: 670, column: 39, scope: !251)
!550 = !{!542, !543, i64 4}
!551 = !DILocation(line: 670, column: 28, scope: !251)
!552 = !DILocation(line: 670, column: 20, scope: !251)
!553 = !DILocation(line: 670, column: 9, scope: !251)
!554 = !DILocation(line: 673, column: 9, scope: !251)
!555 = !DILocation(line: 676, column: 12, scope: !556)
!556 = distinct !DILexicalBlock(scope: !251, file: !3, line: 676, column: 7)
!557 = !DILocation(line: 676, column: 21, scope: !556)
!558 = !DILocation(line: 676, column: 7, scope: !251)
!559 = !DILocation(line: 671, column: 25, scope: !251)
!560 = !DILocation(line: 671, column: 19, scope: !251)
!561 = !DILocation(line: 681, column: 20, scope: !251)
!562 = !{!563, !564, i64 12}
!563 = !{!"eth_hdr", !544, i64 0, !544, i64 6, !564, i64 12}
!564 = !{!"short", !544, i64 0}
!565 = !DILocation(line: 683, column: 7, scope: !251)
!566 = !DILocation(line: 404, column: 40, scope: !418, inlinedAt: !533)
!567 = !DILocation(line: 404, column: 52, scope: !418, inlinedAt: !533)
!568 = !DILocation(line: 404, column: 63, scope: !418, inlinedAt: !533)
!569 = !DILocation(line: 405, column: 63, scope: !418, inlinedAt: !533)
!570 = !DILocation(line: 408, column: 27, scope: !418, inlinedAt: !533)
!571 = !DILocation(line: 409, column: 3, scope: !418, inlinedAt: !533)
!572 = !DILocation(line: 409, column: 29, scope: !418, inlinedAt: !533)
!573 = !DILocation(line: 410, column: 3, scope: !418, inlinedAt: !533)
!574 = !DILocation(line: 410, column: 25, scope: !418, inlinedAt: !533)
!575 = !DILocation(line: 417, column: 3, scope: !418, inlinedAt: !533)
!576 = !DILocation(line: 418, column: 3, scope: !418, inlinedAt: !533)
!577 = !DILocation(line: 418, column: 9, scope: !418, inlinedAt: !533)
!578 = !{!543, !543, i64 0}
!579 = !DILocation(line: 169, column: 65, scope: !385, inlinedAt: !532)
!580 = !DILocation(line: 170, column: 60, scope: !385, inlinedAt: !532)
!581 = !DILocation(line: 171, column: 62, scope: !385, inlinedAt: !532)
!582 = !DILocation(line: 172, column: 44, scope: !385, inlinedAt: !532)
!583 = !DILocation(line: 175, column: 17, scope: !385, inlinedAt: !532)
!584 = !DILocation(line: 207, column: 13, scope: !585, inlinedAt: !532)
!585 = distinct !DILexicalBlock(scope: !525, file: !3, line: 207, column: 9)
!586 = !DILocation(line: 207, column: 17, scope: !585, inlinedAt: !532)
!587 = !DILocation(line: 207, column: 9, scope: !525, inlinedAt: !532)
!588 = !DILocation(line: 211, column: 14, scope: !589, inlinedAt: !532)
!589 = distinct !DILexicalBlock(scope: !525, file: !3, line: 211, column: 9)
!590 = !DILocation(line: 211, column: 18, scope: !589, inlinedAt: !532)
!591 = !DILocation(line: 211, column: 9, scope: !525, inlinedAt: !532)
!592 = !DILocation(line: 216, column: 22, scope: !525, inlinedAt: !532)
!593 = !{!594, !544, i64 1}
!594 = !{!"iphdr", !544, i64 0, !544, i64 0, !544, i64 1, !564, i64 2, !564, i64 4, !564, i64 6, !544, i64 8, !544, i64 9, !564, i64 10, !543, i64 12, !543, i64 16}
!595 = !DILocation(line: 216, column: 11, scope: !525, inlinedAt: !532)
!596 = !DILocation(line: 216, column: 15, scope: !525, inlinedAt: !532)
!597 = !{!598, !544, i64 45}
!598 = !{!"packet_description", !599, i64 0, !543, i64 40, !544, i64 44, !544, i64 45}
!599 = !{!"flow_key", !544, i64 0, !544, i64 16, !544, i64 32, !544, i64 36}
!600 = !DILocation(line: 217, column: 22, scope: !525, inlinedAt: !532)
!601 = !{!594, !544, i64 9}
!602 = !DILocation(line: 218, column: 16, scope: !525, inlinedAt: !532)
!603 = !DILocation(line: 218, column: 22, scope: !525, inlinedAt: !532)
!604 = !{!598, !544, i64 36}
!605 = !DILocation(line: 219, column: 18, scope: !525, inlinedAt: !532)
!606 = !{!594, !564, i64 2}
!607 = !DILocation(line: 222, column: 14, scope: !608, inlinedAt: !532)
!608 = distinct !DILexicalBlock(scope: !525, file: !3, line: 222, column: 9)
!609 = !{!594, !564, i64 6}
!610 = !DILocation(line: 222, column: 23, scope: !608, inlinedAt: !532)
!611 = !DILocation(line: 222, column: 9, scope: !525, inlinedAt: !532)
!612 = !DILocation(line: 226, column: 19, scope: !524, inlinedAt: !532)
!613 = !DILocation(line: 226, column: 9, scope: !525, inlinedAt: !532)
!614 = !DILocation(line: 253, column: 36, scope: !514, inlinedAt: !531)
!615 = !DILocation(line: 253, column: 48, scope: !514, inlinedAt: !531)
!616 = !DILocation(line: 253, column: 64, scope: !514, inlinedAt: !531)
!617 = !DILocation(line: 254, column: 57, scope: !514, inlinedAt: !531)
!618 = !DILocation(line: 258, column: 16, scope: !619, inlinedAt: !531)
!619 = distinct !DILexicalBlock(scope: !514, file: !278, line: 258, column: 7)
!620 = !DILocation(line: 258, column: 20, scope: !619, inlinedAt: !531)
!621 = !DILocation(line: 258, column: 7, scope: !514, inlinedAt: !531)
!622 = !DILocation(line: 255, column: 19, scope: !514, inlinedAt: !531)
!623 = !DILocation(line: 261, column: 17, scope: !513, inlinedAt: !531)
!624 = !{!625, !544, i64 0}
!625 = !{!"icmphdr", !544, i64 0, !544, i64 1, !564, i64 2, !544, i64 4}
!626 = !DILocation(line: 261, column: 7, scope: !514, inlinedAt: !531)
!627 = !DILocation(line: 59, column: 41, scope: !480, inlinedAt: !530)
!628 = !DILocation(line: 59, column: 53, scope: !480, inlinedAt: !530)
!629 = !DILocation(line: 62, column: 9, scope: !480, inlinedAt: !530)
!630 = !DILocation(line: 63, column: 9, scope: !480, inlinedAt: !530)
!631 = !DILocation(line: 64, column: 9, scope: !480, inlinedAt: !530)
!632 = !DILocation(line: 60, column: 17, scope: !480, inlinedAt: !530)
!633 = !DILocation(line: 61, column: 19, scope: !480, inlinedAt: !530)
!634 = !DILocation(line: 74, column: 18, scope: !480, inlinedAt: !530)
!635 = !DILocation(line: 78, column: 13, scope: !480, inlinedAt: !530)
!636 = !DILocation(line: 78, column: 22, scope: !480, inlinedAt: !530)
!637 = !{!625, !564, i64 2}
!638 = !DILocation(line: 79, column: 8, scope: !480, inlinedAt: !530)
!639 = !DILocation(line: 79, column: 12, scope: !480, inlinedAt: !530)
!640 = !{!594, !544, i64 8}
!641 = !DILocation(line: 80, column: 19, scope: !480, inlinedAt: !530)
!642 = !{!594, !543, i64 16}
!643 = !DILocation(line: 81, column: 21, scope: !480, inlinedAt: !530)
!644 = !{!594, !543, i64 12}
!645 = !DILocation(line: 81, column: 14, scope: !480, inlinedAt: !530)
!646 = !DILocation(line: 82, column: 14, scope: !480, inlinedAt: !530)
!647 = !DILocation(line: 83, column: 8, scope: !480, inlinedAt: !530)
!648 = !DILocalVariable(name: "iph", arg: 1, scope: !649, file: !650, line: 53, type: !46)
!649 = distinct !DISubprogram(name: "ipv4_csum_inline", scope: !650, file: !650, line: 53, type: !651, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !654)
!650 = !DIFile(filename: "bpf/csum_helpers.h", directory: "/home/smiano/dev/katran/_build/deps/bpfprog")
!651 = !DISubroutineType(types: !652)
!652 = !{null, !46, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!654 = !{!648, !655, !656, !657}
!655 = !DILocalVariable(name: "csum", arg: 2, scope: !649, file: !650, line: 53, type: !653)
!656 = !DILocalVariable(name: "next_iph_u16", scope: !649, file: !650, line: 54, type: !51)
!657 = !DILocalVariable(name: "i", scope: !658, file: !650, line: 56, type: !74)
!658 = distinct !DILexicalBlock(scope: !649, file: !650, line: 56, column: 3)
!659 = !DILocation(line: 53, column: 43, scope: !649, inlinedAt: !660)
!660 = distinct !DILocation(line: 84, column: 3, scope: !480, inlinedAt: !530)
!661 = !DILocation(line: 54, column: 25, scope: !649, inlinedAt: !660)
!662 = !DILocation(line: 54, column: 10, scope: !649, inlinedAt: !660)
!663 = !DILocation(line: 56, column: 12, scope: !658, inlinedAt: !660)
!664 = !DILocation(line: 57, column: 15, scope: !665, inlinedAt: !660)
!665 = distinct !DILexicalBlock(scope: !666, file: !650, line: 56, column: 55)
!666 = distinct !DILexicalBlock(scope: !658, file: !650, line: 56, column: 3)
!667 = !{!564, !564, i64 0}
!668 = !DILocation(line: 57, column: 28, scope: !665, inlinedAt: !660)
!669 = !DILocation(line: 57, column: 12, scope: !665, inlinedAt: !660)
!670 = !DILocalVariable(name: "csum", arg: 1, scope: !671, file: !650, line: 31, type: !90)
!671 = distinct !DISubprogram(name: "csum_fold_helper", scope: !650, file: !650, line: 31, type: !672, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{!48, !90}
!674 = !{!670, !675}
!675 = !DILocalVariable(name: "i", scope: !671, file: !650, line: 32, type: !74)
!676 = !DILocation(line: 31, column: 44, scope: !671, inlinedAt: !677)
!677 = distinct !DILocation(line: 59, column: 11, scope: !649, inlinedAt: !660)
!678 = !DILocation(line: 32, column: 7, scope: !671, inlinedAt: !677)
!679 = !DILocation(line: 35, column: 14, scope: !680, inlinedAt: !677)
!680 = distinct !DILexicalBlock(scope: !681, file: !650, line: 35, column: 9)
!681 = distinct !DILexicalBlock(scope: !682, file: !650, line: 34, column: 28)
!682 = distinct !DILexicalBlock(scope: !683, file: !650, line: 34, column: 3)
!683 = distinct !DILexicalBlock(scope: !671, file: !650, line: 34, column: 3)
!684 = !DILocation(line: 35, column: 9, scope: !681, inlinedAt: !677)
!685 = !DILocation(line: 85, column: 16, scope: !480, inlinedAt: !530)
!686 = !DILocation(line: 85, column: 14, scope: !480, inlinedAt: !530)
!687 = !{!594, !564, i64 10}
!688 = !DILocation(line: 39, column: 43, scope: !473, inlinedAt: !529)
!689 = !DILocation(line: 39, column: 55, scope: !473, inlinedAt: !529)
!690 = !DILocation(line: 41, column: 3, scope: !473, inlinedAt: !529)
!691 = !DILocation(line: 40, column: 19, scope: !473, inlinedAt: !529)
!692 = !DILocation(line: 43, column: 24, scope: !473, inlinedAt: !529)
!693 = !DILocation(line: 43, column: 3, scope: !473, inlinedAt: !529)
!694 = !DILocation(line: 44, column: 3, scope: !473, inlinedAt: !529)
!695 = !DILocation(line: 45, column: 3, scope: !473, inlinedAt: !529)
!696 = !DILocation(line: 47, column: 1, scope: !473, inlinedAt: !529)
!697 = !DILocation(line: 262, column: 5, scope: !512, inlinedAt: !531)
!698 = !DILocation(line: 269, column: 11, scope: !699, inlinedAt: !531)
!699 = distinct !DILexicalBlock(scope: !514, file: !278, line: 269, column: 7)
!700 = !DILocation(line: 269, column: 15, scope: !699, inlinedAt: !531)
!701 = !DILocation(line: 269, column: 7, scope: !514, inlinedAt: !531)
!702 = !DILocation(line: 256, column: 17, scope: !514, inlinedAt: !531)
!703 = !DILocation(line: 272, column: 12, scope: !704, inlinedAt: !531)
!704 = distinct !DILexicalBlock(scope: !514, file: !278, line: 272, column: 7)
!705 = !DILocation(line: 272, column: 16, scope: !704, inlinedAt: !531)
!706 = !DILocation(line: 272, column: 7, scope: !514, inlinedAt: !531)
!707 = !DILocation(line: 275, column: 27, scope: !514, inlinedAt: !531)
!708 = !DILocation(line: 275, column: 20, scope: !514, inlinedAt: !531)
!709 = !DILocation(line: 276, column: 9, scope: !514, inlinedAt: !531)
!710 = !DILocation(line: 276, column: 15, scope: !514, inlinedAt: !531)
!711 = !{!598, !544, i64 44}
!712 = !DILocation(line: 277, column: 25, scope: !514, inlinedAt: !531)
!713 = !DILocation(line: 277, column: 14, scope: !514, inlinedAt: !531)
!714 = !DILocation(line: 277, column: 18, scope: !514, inlinedAt: !531)
!715 = !{!544, !544, i64 0}
!716 = !DILocation(line: 278, column: 25, scope: !514, inlinedAt: !531)
!717 = !DILocation(line: 174, column: 7, scope: !385, inlinedAt: !532)
!718 = !DILocation(line: 228, column: 11, scope: !523, inlinedAt: !532)
!719 = !DILocation(line: 232, column: 29, scope: !720, inlinedAt: !532)
!720 = distinct !DILexicalBlock(scope: !524, file: !3, line: 231, column: 12)
!721 = !DILocation(line: 232, column: 18, scope: !720, inlinedAt: !532)
!722 = !DILocation(line: 232, column: 22, scope: !720, inlinedAt: !532)
!723 = !DILocation(line: 233, column: 29, scope: !720, inlinedAt: !532)
!724 = !DILocation(line: 425, column: 24, scope: !418, inlinedAt: !533)
!725 = !DILocation(line: 0, scope: !524, inlinedAt: !532)
!726 = !DILocation(line: 416, column: 7, scope: !418, inlinedAt: !533)
!727 = !DILocation(line: 414, column: 8, scope: !418, inlinedAt: !533)
!728 = !DILocation(line: 439, column: 7, scope: !418, inlinedAt: !533)
!729 = !DILocalVariable(name: "data", arg: 1, scope: !730, file: !54, line: 107, type: !46)
!730 = distinct !DISubprogram(name: "parse_tcp", scope: !54, file: !54, line: 107, type: !731, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!389, !46, !46, !389, !365}
!733 = !{!729, !734, !735, !736, !737, !738, !739}
!734 = !DILocalVariable(name: "data_end", arg: 2, scope: !730, file: !54, line: 107, type: !46)
!735 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !730, file: !54, line: 108, type: !389)
!736 = !DILocalVariable(name: "pckt", arg: 4, scope: !730, file: !54, line: 109, type: !365)
!737 = !DILocalVariable(name: "is_icmp", scope: !730, file: !54, line: 111, type: !389)
!738 = !DILocalVariable(name: "off", scope: !730, file: !54, line: 112, type: !90)
!739 = !DILocalVariable(name: "tcp", scope: !730, file: !54, line: 113, type: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !742, line: 25, size: 160, elements: !743)
!742 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !741, file: !742, line: 26, baseType: !296, size: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !741, file: !742, line: 27, baseType: !296, size: 16, offset: 16)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !741, file: !742, line: 28, baseType: !121, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !741, file: !742, line: 29, baseType: !121, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !741, file: !742, line: 31, baseType: !48, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !741, file: !742, line: 32, baseType: !48, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !741, file: !742, line: 33, baseType: !48, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !741, file: !742, line: 34, baseType: !48, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !741, file: !742, line: 35, baseType: !48, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !741, file: !742, line: 36, baseType: !48, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !741, file: !742, line: 37, baseType: !48, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !741, file: !742, line: 38, baseType: !48, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !741, file: !742, line: 39, baseType: !48, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !741, file: !742, line: 40, baseType: !48, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !741, file: !742, line: 55, baseType: !296, size: 16, offset: 112)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !741, file: !742, line: 56, baseType: !322, size: 16, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !741, file: !742, line: 57, baseType: !296, size: 16, offset: 144)
!761 = !DILocation(line: 107, column: 36, scope: !730, inlinedAt: !762)
!762 = distinct !DILocation(line: 440, column: 10, scope: !763, inlinedAt: !533)
!763 = distinct !DILexicalBlock(scope: !764, file: !3, line: 440, column: 9)
!764 = distinct !DILexicalBlock(scope: !765, file: !3, line: 439, column: 32)
!765 = distinct !DILexicalBlock(scope: !418, file: !3, line: 439, column: 7)
!766 = !DILocation(line: 107, column: 48, scope: !730, inlinedAt: !762)
!767 = !DILocation(line: 109, column: 57, scope: !730, inlinedAt: !762)
!768 = !DILocation(line: 111, column: 27, scope: !730, inlinedAt: !762)
!769 = !DILocation(line: 111, column: 43, scope: !730, inlinedAt: !762)
!770 = !DILocalVariable(name: "off", scope: !771, file: !54, line: 65, type: !90)
!771 = distinct !DISubprogram(name: "calc_offset", scope: !54, file: !54, line: 64, type: !772, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!90, !389, !389}
!774 = !{!775, !776, !770}
!775 = !DILocalVariable(name: "is_ipv6", arg: 1, scope: !771, file: !54, line: 64, type: !389)
!776 = !DILocalVariable(name: "is_icmp", arg: 2, scope: !771, file: !54, line: 64, type: !389)
!777 = !DILocation(line: 65, column: 9, scope: !771, inlinedAt: !778)
!778 = distinct !DILocation(line: 112, column: 15, scope: !730, inlinedAt: !762)
!779 = !DILocation(line: 66, column: 7, scope: !771, inlinedAt: !778)
!780 = !DILocation(line: 112, column: 9, scope: !730, inlinedAt: !762)
!781 = !DILocation(line: 114, column: 14, scope: !730, inlinedAt: !762)
!782 = !DILocation(line: 113, column: 18, scope: !730, inlinedAt: !762)
!783 = !DILocation(line: 116, column: 11, scope: !784, inlinedAt: !762)
!784 = distinct !DILexicalBlock(scope: !730, file: !54, line: 116, column: 7)
!785 = !DILocation(line: 116, column: 15, scope: !784, inlinedAt: !762)
!786 = !DILocation(line: 116, column: 7, scope: !730, inlinedAt: !762)
!787 = !DILocation(line: 120, column: 12, scope: !788, inlinedAt: !762)
!788 = distinct !DILexicalBlock(scope: !730, file: !54, line: 120, column: 7)
!789 = !DILocation(line: 120, column: 7, scope: !788, inlinedAt: !762)
!790 = !DILocation(line: 120, column: 7, scope: !730, inlinedAt: !762)
!791 = !DILocation(line: 121, column: 17, scope: !792, inlinedAt: !762)
!792 = distinct !DILexicalBlock(scope: !788, file: !54, line: 120, column: 17)
!793 = !DILocation(line: 122, column: 3, scope: !792, inlinedAt: !762)
!794 = !DILocation(line: 124, column: 7, scope: !730, inlinedAt: !762)
!795 = !DILocation(line: 125, column: 33, scope: !796, inlinedAt: !762)
!796 = distinct !DILexicalBlock(scope: !797, file: !54, line: 124, column: 17)
!797 = distinct !DILexicalBlock(scope: !730, file: !54, line: 124, column: 7)
!798 = !{!799, !564, i64 0}
!799 = !{!"tcphdr", !564, i64 0, !564, i64 2, !543, i64 4, !543, i64 8, !564, i64 12, !564, i64 12, !564, i64 13, !564, i64 13, !564, i64 13, !564, i64 13, !564, i64 13, !564, i64 13, !564, i64 13, !564, i64 13, !564, i64 14, !564, i64 16, !564, i64 18}
!800 = !DILocation(line: 125, column: 16, scope: !796, inlinedAt: !762)
!801 = !DILocation(line: 125, column: 5, scope: !796, inlinedAt: !762)
!802 = !DILocation(line: 125, column: 26, scope: !796, inlinedAt: !762)
!803 = !DILocation(line: 126, column: 33, scope: !796, inlinedAt: !762)
!804 = !DILocation(line: 127, column: 3, scope: !796, inlinedAt: !762)
!805 = !DILocation(line: 130, column: 33, scope: !806, inlinedAt: !762)
!806 = distinct !DILexicalBlock(scope: !797, file: !54, line: 127, column: 10)
!807 = !{!799, !564, i64 2}
!808 = !DILocation(line: 130, column: 16, scope: !806, inlinedAt: !762)
!809 = !DILocation(line: 130, column: 5, scope: !806, inlinedAt: !762)
!810 = !DILocation(line: 130, column: 26, scope: !806, inlinedAt: !762)
!811 = !DILocalVariable(name: "data", arg: 1, scope: !812, file: !54, line: 81, type: !46)
!812 = distinct !DISubprogram(name: "parse_udp", scope: !54, file: !54, line: 81, type: !731, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !813)
!813 = !{!811, !814, !815, !816, !817, !818, !819}
!814 = !DILocalVariable(name: "data_end", arg: 2, scope: !812, file: !54, line: 81, type: !46)
!815 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !812, file: !54, line: 82, type: !389)
!816 = !DILocalVariable(name: "pckt", arg: 4, scope: !812, file: !54, line: 83, type: !365)
!817 = !DILocalVariable(name: "is_icmp", scope: !812, file: !54, line: 85, type: !389)
!818 = !DILocalVariable(name: "off", scope: !812, file: !54, line: 86, type: !90)
!819 = !DILocalVariable(name: "udp", scope: !812, file: !54, line: 87, type: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !822, line: 23, size: 64, elements: !823)
!822 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!823 = !{!824, !825, !826, !827}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !821, file: !822, line: 24, baseType: !296, size: 16)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !821, file: !822, line: 25, baseType: !296, size: 16, offset: 16)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !821, file: !822, line: 26, baseType: !296, size: 16, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !821, file: !822, line: 27, baseType: !322, size: 16, offset: 48)
!828 = !DILocation(line: 81, column: 36, scope: !812, inlinedAt: !829)
!829 = distinct !DILocation(line: 444, column: 10, scope: !830, inlinedAt: !533)
!830 = distinct !DILexicalBlock(scope: !831, file: !3, line: 444, column: 9)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 443, column: 39)
!832 = distinct !DILexicalBlock(scope: !765, file: !3, line: 443, column: 14)
!833 = !DILocation(line: 81, column: 48, scope: !812, inlinedAt: !829)
!834 = !DILocation(line: 83, column: 57, scope: !812, inlinedAt: !829)
!835 = !DILocation(line: 85, column: 43, scope: !812, inlinedAt: !829)
!836 = !DILocation(line: 65, column: 9, scope: !771, inlinedAt: !837)
!837 = distinct !DILocation(line: 86, column: 15, scope: !812, inlinedAt: !829)
!838 = !DILocation(line: 66, column: 7, scope: !771, inlinedAt: !837)
!839 = !DILocation(line: 86, column: 9, scope: !812, inlinedAt: !829)
!840 = !DILocation(line: 88, column: 14, scope: !812, inlinedAt: !829)
!841 = !DILocation(line: 87, column: 18, scope: !812, inlinedAt: !829)
!842 = !DILocation(line: 90, column: 11, scope: !843, inlinedAt: !829)
!843 = distinct !DILexicalBlock(scope: !812, file: !54, line: 90, column: 7)
!844 = !DILocation(line: 90, column: 15, scope: !843, inlinedAt: !829)
!845 = !DILocation(line: 90, column: 7, scope: !812, inlinedAt: !829)
!846 = !DILocation(line: 94, column: 7, scope: !812, inlinedAt: !829)
!847 = !DILocation(line: 95, column: 33, scope: !848, inlinedAt: !829)
!848 = distinct !DILexicalBlock(scope: !849, file: !54, line: 94, column: 17)
!849 = distinct !DILexicalBlock(scope: !812, file: !54, line: 94, column: 7)
!850 = !{!851, !564, i64 0}
!851 = !{!"udphdr", !564, i64 0, !564, i64 2, !564, i64 4, !564, i64 6}
!852 = !DILocation(line: 95, column: 16, scope: !848, inlinedAt: !829)
!853 = !DILocation(line: 95, column: 5, scope: !848, inlinedAt: !829)
!854 = !DILocation(line: 95, column: 26, scope: !848, inlinedAt: !829)
!855 = !DILocation(line: 96, column: 33, scope: !848, inlinedAt: !829)
!856 = !DILocation(line: 97, column: 3, scope: !848, inlinedAt: !829)
!857 = !DILocation(line: 100, column: 33, scope: !858, inlinedAt: !829)
!858 = distinct !DILexicalBlock(scope: !849, file: !54, line: 97, column: 10)
!859 = !{!851, !564, i64 2}
!860 = !DILocation(line: 100, column: 16, scope: !858, inlinedAt: !829)
!861 = !DILocation(line: 100, column: 5, scope: !858, inlinedAt: !829)
!862 = !DILocation(line: 100, column: 26, scope: !858, inlinedAt: !829)
!863 = !DILocation(line: 0, scope: !765, inlinedAt: !533)
!864 = !DILocation(line: 465, column: 9, scope: !865, inlinedAt: !533)
!865 = distinct !DILexicalBlock(scope: !866, file: !3, line: 464, column: 10)
!866 = distinct !DILexicalBlock(scope: !418, file: !3, line: 462, column: 7)
!867 = !DILocation(line: 465, column: 13, scope: !865, inlinedAt: !533)
!868 = !DILocation(line: 468, column: 24, scope: !418, inlinedAt: !533)
!869 = !DILocation(line: 468, column: 14, scope: !418, inlinedAt: !533)
!870 = !DILocation(line: 468, column: 7, scope: !418, inlinedAt: !533)
!871 = !DILocation(line: 468, column: 12, scope: !418, inlinedAt: !533)
!872 = !{!873, !564, i64 16}
!873 = !{!"vip_definition", !544, i64 0, !564, i64 16, !544, i64 18}
!874 = !DILocation(line: 469, column: 7, scope: !418, inlinedAt: !533)
!875 = !DILocation(line: 469, column: 13, scope: !418, inlinedAt: !533)
!876 = !{!873, !544, i64 18}
!877 = !DILocation(line: 470, column: 14, scope: !418, inlinedAt: !533)
!878 = !DILocation(line: 411, column: 20, scope: !418, inlinedAt: !533)
!879 = !DILocation(line: 471, column: 8, scope: !880, inlinedAt: !533)
!880 = distinct !DILexicalBlock(scope: !418, file: !3, line: 471, column: 7)
!881 = !DILocation(line: 471, column: 7, scope: !418, inlinedAt: !533)
!882 = !DILocation(line: 472, column: 14, scope: !883, inlinedAt: !533)
!883 = distinct !DILexicalBlock(scope: !880, file: !3, line: 471, column: 18)
